tests/Mock/PaymentIntentPaymentAttemptFailed.txt

HTTP/1.1 200 OK
Server: nginx
Date: Tue, 7 Nov 2023 21:37:26 GMT
Content-Type: application/json
Cache-Control: no-cache, no-store

{
  "id": "payment_intent_id_fetched",
  "object": "payment_intent",
  "amount": 246,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {}
  },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "client_secret": "payment_intent_client_secret",
  "confirmation_method": "manual",
  "created": 1567086779,
  "currency": "eur",
  "customer": null,
  "description": "2 Tickets for Eventix | event: Serious Event | start: 2019-10-03 15:00",
  "invoice": null,
  "last_payment_error": {
    "code": "payment_intent_payment_attempt_failed",
    "doc_url": "https://stripe.com/docs/error-codes/payment-intent-payment-attempt-failed",
    "message": "payment_attempt_failed_error_message",
    "payment_method": {
      "id": "payment_method_id",
      "object": "payment_method",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": "12312",
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "card": {
        "brand": "visa",
        "checks": {
          "address_line1_check": null,
          "address_postal_code_check": "unchecked",
          "cvc_check": "unchecked"
        },
        "country": "DE",
        "exp_month": 12,
        "exp_year": 2031,
        "fingerprint": "zBMZHw7mjcq2kqes",
        "funding": "credit",
        "generated_from": null,
        "last4": "3184",
        "networks": {
          "available": [
            "visa"
          ],
          "preferred": null
        },
        "three_d_secure_usage": {
          "supported": true
        },
        "wallet": null
      },
      "created": 1567086779,
      "customer": null,
      "livemode": false,
      "metadata": {},
      "type": "card"
    },
    "type": "invalid_request_error"
  },
  "latest_charge": null,
  "livemode": false,
  "metadata": {},
  "next_action": null,
  "on_behalf_of": null,
  "payment_method": null,
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_payment_method",
  "transfer_data": null,
  "transfer_group": null
}