tests/Mock/PaymentIntentPaymentRequiresAction.txt

HTTP/1.1 200 OK
Server: nginx
Date: Tue, 7 Nov 2023 21:37:26 GMT
Content-Type: application/json
Cache-Control: no-cache, no-store

{
  "id": "payment_intent_id_requires_action",
  "object": "payment_intent",
  "allowed_source_types": [
    "card"
  ],
  "amount": 2000,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {
    }
  },
  "amount_received": 0,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges?payment_intent=pi_3OABtn4Clds3ZoJo1gDlVu1z"
  },
  "client_secret": "client_secret_requires_action",
  "confirmation_method": "automatic",
  "created": 1699450467,
  "currency": "usd",
  "customer": null,
  "description": "(created by Stripe CLI)",
  "invoice": null,
  "last_payment_error": null,
  "latest_charge": null,
  "livemode": false,
  "metadata": {
  },
  "next_action": {
    "type": "use_stripe_sdk",
    "use_stripe_sdk": {
      "type": "three_d_secure_redirect",
      "stripe_js": "https://hooks.stripe.com/redirect/authenticate/src_1OABtn4Clds3ZoJo5xEguB3R?client_secret=src_client_secret_o2Dbn1jlJRzwqxjia87ZnSst&source_redirect_slug=test_YWNjdF8xMDN5ZUI0Q2xkczNab0pvLF9PeThBUlVIdnd0NWpKTEplWTk4MHBlVG9RbXQ5eldO0100hTpDobGg",
      "source": "src_1OABtn4Clds3ZoJo5xEguB3R"
    }
  },
  "next_source_action": {
    "type": "use_stripe_sdk",
    "use_stripe_sdk": {
      "type": "three_d_secure_redirect",
      "stripe_js": "https://hooks.stripe.com/redirect/authenticate/src_1OABtn4Clds3ZoJo5xEguB3R?client_secret=src_client_secret_o2Dbn1jlJRzwqxjia87ZnSst&source_redirect_slug=test_YWNjdF8xMDN5ZUI0Q2xkczNab0pvLF9PeThBUlVIdnd0NWpKTEplWTk4MHBlVG9RbXQ5eldO0100hTpDobGg",
      "source": "src_1OABtn4Clds3ZoJo5xEguB3R"
    }
  },
  "on_behalf_of": null,
  "payment_method": "pm_1OABtn4Clds3ZoJod9YPIr8d",
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": null,
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "requires_source_action",
  "transfer_data": null,
  "transfer_group": null
}