tests/Mock/PaymentIntentPaymentSuccess.txt

HTTP/1.1 200 OK
Server: nginx
Date: Tue, 7 Nov 2023 21:37:26 GMT
Content-Type: application/json
Cache-Control: no-cache, no-store

{
  "id": "payment_intent_id_payment_success",
  "object": "payment_intent",
  "allowed_source_types": [
    "card"
  ],
  "amount": 2000,
  "amount_capturable": 0,
  "amount_details": {
    "tip": {
    }
  },
  "amount_received": 2000,
  "application": null,
  "application_fee_amount": null,
  "automatic_payment_methods": null,
  "canceled_at": null,
  "cancellation_reason": null,
  "capture_method": "automatic",
  "charges": {
    "object": "list",
    "data": [
      {
        "id": "ch_3OABlP4Clds3ZoJo1L3WQIDe",
        "object": "charge",
        "amount": 2000,
        "amount_captured": 2000,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_3OABlP4Clds3ZoJo1j4R5Wsp",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": null,
          "name": null,
          "phone": null
        },
        "calculated_statement_descriptor": "EVENTIX",
        "captured": true,
        "card": null,
        "created": 1699449947,
        "currency": "usd",
        "customer": null,
        "description": "(created by Stripe CLI)",
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_balance_transaction": null,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {
        },
        "invoice": null,
        "livemode": false,
        "metadata": {
        },
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "risk_score": 54,
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_3OABlP4Clds3ZoJo1JhpcBFQ",
        "payment_method": "pm_1OABlP4Clds3ZoJoKrSfQcg4",
        "payment_method_details": {
          "card": {
            "amount_authorized": 2000,
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": "pass"
            },
            "country": "US",
            "exp_month": 11,
            "exp_year": 2024,
            "extended_authorization": {
              "status": "disabled"
            },
            "fingerprint": "LCwo5ifNMb89QxWV",
            "funding": "credit",
            "incremental_authorization": {
              "status": "unavailable"
            },
            "installments": null,
            "last4": "4242",
            "mandate": null,
            "multicapture": {
              "status": "unavailable"
            },
            "network": "visa",
            "network_token": {
              "used": false
            },
            "overcapture": {
              "maximum_amount_capturable": 2000,
              "status": "unavailable"
            },
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/payment/CAcaFwoVYWNjdF8xMDN5ZUI0Q2xkczNab0pvKNyYrqoGMgbk3wSiGpw6LBYqYA0hSrjbLD7FYRQ8BCQmowho-CxUY546P8smvbISDguSPlhTiI-JZ5RT",
        "refunded": false,
        "refunds": [
        ],
        "review": null,
        "shipping": {
          "address": {
            "city": "San Francisco",
            "country": "US",
            "line1": "510 Townsend St",
            "line2": null,
            "postal_code": "94103",
            "state": "CA"
          },
          "carrier": null,
          "name": "Jenny Rosen",
          "phone": null,
          "tracking_number": null
        },
        "source": null,
        "source_transfer": null,
        "statement_description": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "paid",
        "transfer_data": null,
        "transfer_group": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/charges?payment_intent=pi_3OABlP4Clds3ZoJo1JhpcBFQ"
  },
  "client_secret": "client_secret_payment_success",
  "confirmation_method": "automatic",
  "created": 1699449947,
  "currency": "usd",
  "customer": null,
  "description": "(created by Stripe CLI)",
  "invoice": null,
  "last_payment_error": null,
  "latest_charge": "ch_3OABlP4Clds3ZoJo1L3WQIDe",
  "livemode": false,
  "metadata": {
  },
  "next_action": null,
  "next_source_action": null,
  "on_behalf_of": null,
  "payment_method": "pm_1OABlP4Clds3ZoJoKrSfQcg4",
  "payment_method_configuration_details": null,
  "payment_method_options": {
    "card": {
      "installments": null,
      "mandate_options": null,
      "network": null,
      "request_three_d_secure": "automatic"
    }
  },
  "payment_method_types": [
    "card"
  ],
  "processing": null,
  "receipt_email": null,
  "review": null,
  "setup_future_usage": null,
  "shipping": {
    "address": {
      "city": "San Francisco",
      "country": "US",
      "line1": "510 Townsend St",
      "line2": null,
      "postal_code": "94103",
      "state": "CA"
    },
    "carrier": null,
    "name": "Jenny Rosen",
    "phone": null,
    "tracking_number": null
  },
  "source": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}